In [8]:
import pandas as pd

In [9]:
df = pd.read_csv("./Dataset/stock_data.csv")

In [3]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Replace with na_values(using List)

In [ ]:
df = pd.read_csv("./Dataset/stock_data.csv", na_values = ["not available","n.a."])
df

# Replace with na_values(using Dictionary)

In [11]:
df = pd.read_csv("./Dataset/stock_data.csv", na_values={
    "eps": ["not available","n.a."],
    "revenue": ["not available","n.a.",-1],
    "price": ["not available","n.a."],
    "people":["not available","n.a."]
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [12]:
df.fillna(0, inplace=True)

In [13]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0              0
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL    0.00     50.0  1023.0  mukesh ambani
4    TATA   5.60      0.0     0.0     ratan tata

## Save the process data:

In [14]:
df.to_csv("new.csv", index = False)

In [17]:
new_data = pd.read_csv("new.csv")

In [18]:
new_data

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0              0
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL    0.00     50.0  1023.0  mukesh ambani
4    TATA   5.60      0.0     0.0     ratan tata

In [20]:
new_data.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [27]:
new_data.to_csv("new.csv", columns=["people", "tickers", "price"], index = False)

In [28]:
new = pd.read_csv("new.csv")

In [29]:
new

          people tickers   price
0     larry page   GOOGL   845.0
1              0     WMT    65.0
2     bill gates    MSFT    64.0
3  mukesh ambani    RIL   1023.0
4     ratan tata    TATA     0.0